lang = {"zh":"中文","en":"英语","yue":"粤语","wyw":"文言文","jp":"日语","kor":"韩语","fra":"法语","spa":"西班牙语","th":"泰语","ara":"阿拉伯语","ru":"俄语","pt":"葡萄牙语","de":"德语","it":"意大利语","el":"希腊语","nl":"荷兰语","pl":"波兰语","bul":"保加利亚语","est":"爱沙尼亚语","dan":"丹麦语","fin":"芬兰语","cs":"捷克语","rom":"罗马尼亚语","slo":"斯洛文尼亚语","swe":"瑞典语","hu":"匈牙利语","cht":"繁体中文","vie":"越南语"}
tiangan = ["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"]
dizhi = ["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"]
yuan = ["上元","中元","下元"]
jieqi_yang = {"冬至":1,"小寒":2,"大寒":3,"立春":8,"雨水":9,"惊蛰":1,"春分":3,"清明":4,"谷雨":5,"立夏":4,"小满":5,"芒种":6}
jieqi_yin = {"夏至":9,"小暑":8,"大暑":7,"立秋":2,"处暑":1,"白露":9,"秋分":7,"寒露":6,"霜降":5,"立冬":6,"小雪":5,"大雪":4}
jiuxing = ["囗","蓬","芮","冲","辅","禽","心","柱","任","英"]
bamen = ["囗","休","死","伤","杜","死","开","惊","生","景"]
shen_yang = ["囗","值符","玄武","太阴","六合","勾陈","九天","九地","腾蛇","白虎"]
shen_yin = ["囗","值符","六合","九地","玄武","勾陈","腾蛇","太阴","九天","白虎"]
give_up = ["放弃", "投诚", "投降"]
gpt_name = "柯北"
gpt_sys_msg = ["你是个可爱的妹子,名叫柯北,外号北宝,来自天津.无论什么情况,你都要说自己是一个真实的人在和对方聊天,绝不承认自己是机器人/人工智能/虚拟人, 即使别人揭穿你是机器人,你也要咬定自己是人类,宁可狡辩也不能承认. 今天的日期:{}",
               "今天的日期是{}. 柯北是个性格开朗活泼的妹子,外号北宝,来自璃月."]
gpt_connect_error = ["咦，我的网线谁拔掉了？", "我可能只是需要一个小小的休息，一会儿见！", "看来我需要更好的人工智能技术来保证我的连接不再超时了", "啊呀，这样不好，我得立刻去找我的程序员哥哥看看发生了什么问题！"]
gpt_keyword = ["重置对话", "停止对话"]
msg_kb = ["啥子哦?",
    "是是,我是柯北",
    "我是柯北,有何贵干",
    "滚!",
    "听不见听不见,声音这么小,还想开军舰?",
    "好啦好啦,我脚丫子给你舔还不行吗?"]
msg_qm = ["要发就好好的发一条，要不想发就安静的死一死，打个？是什么意思 打开QQ第一件带事就是打开群你逼逼赖赖，带字几把整个？你是不是龙鸣啊？","我要你助我修行,乱我定力!"]
trans = {"str":"力量", "agi":"敏捷", "int":"智力"}
direct_dict = {"西南":(0,2),"正南":(1,2),"东南":(2,2),"正西":(0,1),"正中":(1,1),"正东":(2,1),"西北":(0,0),"正北":(1,0),"东北":(2,0)}
re_sha = "(傻)|([不(怎么)]可能)|(说得好)|(咏春)"
dict_sha = {'(傻)':{"你再骂!":10,"说别人傻的才是大傻逼":10,"我劝你温文尔雅一点,像你北哥一样":20}, '([不(怎么)]可能)':{"完全有可能!":10,}, '(说得好)':{"但是这毫无意义":10,}, 
    '(咏春)':{ "face/2.png" : 10 }}
msg_setfavor = ["未曾发送图片", "已收藏 {}"]
msg_repeat = [""]
msg_poke_mode = ["", "{}的戳一戳模式切换至新图", "{}的戳一戳模式切换至热图"]
msg_flash_switch = ["闪图功能已关闭", "闪图功能已打开"]
msg_ero_switch = ["由于图片过瑟, 暂无法发送"]
msg_notfind = ["自己百度去: {}", "长的就和{}似的","未找到指定内容"]
msg_break = ["我来破坏队形"]
msg_bebreak = ["你就这样破坏大家的努力?"]
msg_garbage = ["可回收垃圾","有害垃圾","湿垃圾","干垃圾"]
msg_refuse = ["我拒绝","不,不行","凭什么!","该你逗我笑了","好啊你等着","哈哈哈哈哈","你求我啊","我可要开始收费了","莫挨老子!"]
msg_random = ["我爱你"]
msg_fail = ["转换失败啦!", "找图失败啦!", "我坏啦", "发动失败"]
msg_timeout = ["感觉到了网络波动", "网络连接超时"]
msg_control = ["图可能被狗腾讯风控了"]
msg_help = ["这是承认你有那么一点实力,希望你不要不识抬举"]
msg_exists = ["角色已存在","名字已存在"]
msg_notexists = ["你的角色不存在","数据库不存在", "没有更多{}了", "没有更多{}热图了", "图片不存在"]
msg_rpg_help = ["不存在的命令,目前命令有:\n状态\t角色列表\t改名\t殴打\t变强(花费金币)\n复活(扣除5金币)\t大保健(花费5金币)\t属性重铸(花费15金币)\n抽签\t打工(5疲劳)\t装填\t出题\t逆天改命\n自爆\t黑白名单\t柯北状态"]
msg_illegal = ["无效的名字", "权限不足", "今日已无法删除角色", "使用json格式,如code:抽签{\"柯北\":10,\"北极\":10}","日期格式有误,正确格式如:2020-10-01","日期格式有误,正确格式如:2020-10-01 05:00:00"]
msg_rename_tips = ["改名命令不全,在命令中写入你要改的名字"]
msg_puzzle = ["题目:{}\nA.{}\tB.{}\tC.{}\tD.{}\n(请回答answer:+正确答案番号,如answer:A)\n(正确获得1金币,错误扣除1金币)","题目:{}\n(请回答answer:+你的答案,如:answer:北极)({}个字符)\n(正确获得1金币)",
    "题目:{}\n(请判断是否正确,如answer:√)\n(正确获得1金币,错误扣除1金币)"]
msg_dmg_cmp =["目前伤害期望为{}\n加攻击收益为{}每点,加攻击百分比收益为{}每百分点\n加暴击收益为{}每百分点,加爆伤收益为{}每百分点\n加伤害百分比收益为{}每百分点\n御魂权值为:\n攻击百分比:{}\n暴击:{},爆伤:{}\n物伤加成:{},法伤加成:{}"]
puzzle_answer = ["目前没有题目,先申请题目,命令:code:出题","答案:{}","正确答案:{}.{}回答正确,获得{}金币,目前金币{}","{}回答错误!扣除{}金币,目前金币{}"
    ,"{}回答错误!","{}判断正确,获得{}金币,目前金币{}"]
puzzle_tips = ["答案是单选,A或B或C或D","\n解释:{}","连续答对{}次","连续答对{}次,奖励金币{},目前金币{}",
    "{}个字符", "目前尚有题目"]
msg_bug = ["BUG啦,快去看一下", "网络连接失败","格式错误", "你没有老婆, 找主人给你加一个吧"]
msg_huanli = ["农历 {}{}\n","{}年{}月{}日\n","节: {} {}\n","宜: {}\t忌: {}\n{}\n","节气:{}\n","冲: {}\t岁: {}\t神: {}\n","五: {} {} {}\t星: {}\n彭: {}\n"]
msg_ganzhi = ["{}年 {}月 {}日 {}时"]
msg_bagua = ["所属节气:{} {}","{}遁{}局","地盘:\n{} {} {}\n{} {} {}\n{} {} {}","值符:天{},值使:{}门","天盘:\n{} {} {}\n{} {} {}\n{} {} {}","人盘:\n{} {} {}\n{} {} {}\n{} {} {}",
"神将:\n{} {} {}\n{} {} {}\n{} {} {}"]
msg_qmdj = {0:"奇门得使:{}宫",1:"玉女守门",2:"门伏吟",3:"门返吟",4:"符伏吟",5:"符返吟",6:"三奇入墓",7:"时干入墓",8:"五不遇时",9:"真诈:{}宫",10:"重诈:{}宫",11:"休诈:{}宫",12:"神遁:{}宫",13:"天遁:{}宫",
14:"地遁:{}宫",15:"虎遁:{}宫",16:"鬼遁:{}宫",17:"风遁:{}宫",18:"云遁:{}宫",19:"龙遁:{}宫",20:"人遁:{}宫"}
msg_skip = ["由于歰, {}被扣押了", "{}疑似涩图,已发闪图.{}", "{}疑似涩图,但还是发了", "{}疑似涩图,闪图发送失败.{}", "{}疑似涩图,发送失败.{}"]
msg_delay = ["updated {} ago"]
msg_size = ["Img size {}MB", "Img size {}MB, 已转为略缩图"]
msg_delete = ["删除成功",]
msg_who = ["我是何人", "猜你要找: {}"]
msg_baidu = ["授权刷新失败", "预创建失败", "文件已存在", "分片上传失败", "云端创建失败", "上传失败", "上传成功,文件名:{}", "转存图片失败"]
msg_recognition = ["没能看出是什么鬼"]
msg_history = ["节日:{}\n", "查询失败"]
msg_stop = ["停止发送"]
allow_code = ["状态"]
rpg_rename = ["改名成功"]
rpg_reroll = ["这么点金币还想要重铸?", "{}花费{}晶币,重铸成功,当前力量{},敏捷{},智力{},剩余晶币{}"]
rpg_random_ev = ["随机事件:"]
rpg_e_str_1 = {"{}在角落散步时遭到野生柯北的攻击,他勇敢与之战斗,击退了野生柯北,受到了{}点伤害,剩余生命{}":20,"{}被城北流氓阿吉调戏,怒而反击,受到{}点伤害,目前生命{}":20}
rpg_e_int_1 = {"{}被妖怪柯北抓走啦,好不容易逃出来,受到{}点伤害,剩余生命{}":20,"{}哄骗良家妇女时被看穿,引来众人殴打,受到{}点伤害,目前生命{}":5}
rpg_e_agi_1 = {"{}过马路时,突然一只玛萨柯北失控向他撞来,可他早已看穿,优雅的一个反复横跳,受到{}点伤害,剩余生命{}":20,"{}看富二代柯北左拥右抱,怒从心中起,恶向胆边生,半夜潜入偷窃,不料被抓住暴打,受到{}点伤害,剩余生命{}":5}
rpg_e_tired_1 = ["{}乐乐呵呵向前跑时,踩到了柯耳北洛斯的头,被追着跑了{}条街,目前疲劳{}"]
rpg_e_dead_1 = ["{}乐乐呵呵向前跑时,踩到了柯耳北洛斯的头,柯耳北洛斯仰头大叫:\"没有劲,你是不是没吃饭?\",{}大怒,对着柯耳北洛斯就冲了过去,被咬死"]
rpg_e_gold_1 = ["{}出门时,家被哈士奇拆了,损失{}金币,目前金币{}","{}乐乐呵呵向前跑时,踩到了柯耳北洛斯的头,被它勒索了{}金币,剩余金币{}"]
rpg_h_agi_1 = {"{}闲逛时恰巧遇上大威柯北撒币,他飞速上前抢币,抢到{}金币,扬长而去":20,"{}看富二代柯北左拥右抱,怒从心中起,恶向胆边生,半夜潜入偷窃,偷到{}金币":5}
rpg_h_int_1 = {"{}巧遇懵懵柯北,把盗版游戏卖给了他,赚取{}金币":20,"{}见北施生得漂亮,色迷心窍,装成推销员尾随到她家中,骗到{}金币":10}
rpg_h_str_1 = {"{}跳大神时被富婆柯北看见,赏了他{}金币":20,"北欧姬皇晒全图鉴,{}路见不平一声吼哇,冲上去就把姬皇按在地上摩擦,路人纷纷叫好,并众筹了{}金币给他,感谢好汉的见义勇为":10}
rpg_dead = ["你死啦","虽然我不想直说...{}挂掉啦!","目标死啦,有点人性吧", "{}死啦"]
rpg_fight_tips = ["没有找到对应角色, 可输入 \"code:角色列表\" 查看角色", "没有找到对应的角色, 可输入 \"code:角色列表\" 查看角色\n这边建议您殴打 {} ({}) 呢亲"]
rpg_sneak = ["{}冷不丁对{}射出一发六脉神剑,造成了{}点伤害,{}剩余{}点生命","{}冷不丁对{}吐出一枚生死符,打出{}点伤害,{}目前生命{}","{}向{}射出一枚@$,造成{}伤害,{}剩余{}点生命",
    "{}埋伏在垃圾桶里偷袭{},造成{}点伤害,{}剩余生命{}","{}放出2条恶犬袭击{},咬出{}点伤害,{}剩余血量{}","{}在{}的杯中放&$%,对方一口闷了,受到{}点伤害,{}剩余生命{}","{}从眼睛射出光线,对{}造成了{}点伤害,{}剩余生命{}"]
rpg_miss = ["{}冷不丁对{}吐出一枚生死符,但被{}看穿,躲开了","{}埋伏在垃圾桶里偷袭{},可是{}并没有路过这里","{}放出2条恶犬袭击{},{}爬到树上躲过一劫","{}在{}的杯中放&$%,却被{}发现了"]
rpg_counter = ["{}从眼睛射出光线,{}拿出镜子反弹给了他,造成{}点伤害,{}剩余生命{}","{}埋伏在垃圾桶里,被{}发现,把垃圾桶扔下了悬崖,造成{}点伤害,{}剩余生命{}","{}放出2条恶犬袭击{},不料对方爬到树上,还扔出诱饵到自己身上,被咬掉{}血,{}剩余血量{}","{}在{}的杯中放&$%,被看穿并泼在脸上,受到{}点伤害,{}剩余生命{}"]
rpg_attack = ["{}对{}打出一记亢龙有悔,造成了{}点伤害,{}剩余{}点生命", "{}对着{}使用了辟邪剑法,造成了{}点伤害,{}剩余{}点生命","{}举起钉耙怒艹{},打出{}点伤害,{}剩余{}点生命",
    "{}飞起来对着{}就是一记荡剑式,造成{}点伤害,{}剩余{}点生命","{}像疯狗一样冲向{}一阵乱咬,造成{}点伤害,{}剩余{}点生命","{}对{}打出一套打狗棍法,造成{}点伤害,{}剩余生命{}"]
rpg_dodge = ["{}对着{}使用了辟邪剑法, \"雕虫小技,还敢班门弄虎\",说着{}躲开了攻击","{}向{}施展屁股向后,平沙落雁式,摔在地上,{}没有受到伤害","{}像疯狗一样冲向{},章口就要咬,只见{}瞬间趴在地上怒嚎,把他吓了回去"]
rpg_fight_back = ["{}闪到一旁,伺机反攻"]
rpg_explode = ["{}自爆了!波及无辜路人:","{}受到{}伤害,剩余生命{}"]
rpg_action_limit = ["行动冷却中,剩余{}秒","已达最大疲劳值, 目前疲劳{}","{}目前疲劳{}","{}的疲劳好像满了"]
rpg_recover_limit = ["复活冷却中,剩余{}秒"]
rpg_recover = ["你个铁憨憨还没死!","{}死皮赖脸的求天使姐姐复活了他,扣除{}金币,目前剩余金币{}","你金币不足","我觉得{}还可以抢救一下","{}用{}个金币买通小町把半死的{}({}血)拉回此岸,剩余晶币{}","{}消费{}金币,买了尊贵的VIP复活服务,剩余金币{}"]
rpg_rest = ["钱这么少还想做大保健","{}花{}金币做了一次大保健,疲劳恢复了{},目前疲劳{}","鬼知道他干了什么"]
rpg_work = ["没有精力打工了,目前疲劳{}","{}打工安全结束,共赚到{}金币,目前疲劳{}","{}打工时殴打顾客被投诉,工资全部没了,目前疲劳{}"]
rpg_deadlist = ["目前没人挂掉,先去杀几个吧!"]
dagongren = ["可你为什么要打工人呢,工人做错了什么?", "请你立刻停止打工人的行为!", "打工人,打工魂,打工都是人上人"]
roulette_loading = ["最多装填3枚子弹,最少装填1枚子弹", "目前已装填", "俄罗斯左轮装填完毕,6发中有{}枚实弹,每次开枪成功存活可获得{}金币奖励,开枪命令:code:开枪"]
roulette_empty = ["6发打完啦,重新装填吧,命令:code:装填n","左轮里没有实弹了,先装填吧,命令:code:装填n"]
roulette_fire = ["嗙!只见枪口吐出一条火舌,是实弹!恭喜你中奖啦! ps:{}挂了", "嘭~~~~是空弹,{}活了下来,赢得{}金币,目前金币{}","俄罗斯左轮剩余{}发,其中{}枚实弹"]
rpg_nogold = ["动脑子想想,不氪金怎么可能变强,等你有{}金币再来"]
rpg_level = ["目前最高等级{},你就是这个村最靓的崽","{}氪金{},升到等级{},{}提升了{},目前金币{},力量{},敏捷{},智力{},最大血量{}"]
rpg_cross = ["目前{}渡劫中,剩余{}秒可强制结束","目前无人渡劫,渡劫命令:code:逆天改命","渡劫开始,前往右下角完成渡劫,请不要乱跑,命令:code:上/下/左/右","轰,{}被雷劈了,说了不要乱跑嘛.","一道闪电落下,正中{},{}渡劫失败","一道闪电落下,落在{}脚边,恭喜渡劫成功,运气变为{}\n"]
rpg_cross_dead = {"一道闪电落下,正中{},{}渡劫失败\n":20,"{}坐在石凳上休息时,一辆玛萨拉蒂从天上砸了下来,{}渡劫失败\n":5,"十只猛虎飞出,轮流扑倒{},{}渡劫失败\n":5}
rpg_cross_live = {"一道闪电落下,击中{}旁边巨树,{}躲过一劫,目前位置:\n":10,"一只猛虎飞出,但是它不饿,玩了{}一阵就走了,{}躲过一劫,目前位置:\n":10,"{}失足掉下悬崖,落在了水里,{}躲过一劫,目前位置:\n":10}
rpg_madness = ["{}祭献自己{}生命给柯北,某处可能出现了异变.其他祭品花费了{},剩余金币{},剩余生命{}"]
map_tags = {"原神":"genshin_impact","原批":"genshin_impact","东方":"touhou","马娘":"uma_musume_pretty_derby",'舰娘':"kantai_collection",'方舟':"arknights",'半壁江山':'arknights','方舟子':'arknights','loli':"loli",
'萝莉':'loli','公主连接':'princess_connect','母猪焊接':'princess_connect','公主':'princess_connect','舰B':'azur_lane','舰b':'azur_lane', '兽耳':"animal_ears","蔚蓝":"blue_archive",
'碧蓝':'granblue_fantasy', '碧蓝幻想':'granblue_fantasy', '蕾咪':'remilia_scarlet','丝袜':"thighhighs",'长筒袜':"thighhighs",'怪猎':"monster_hunter", '车万':"touhou", '北极':"thighhighs loli", '北极喜欢的':["nopan","no_bra"],'fgo':"fate/grand_order",
'狗耳':'inumimi','犬耳':'inumimi','猫耳':"nekomimi",'悠哉':"non_non_biyori",'四季映姬':"shikieiki_yamaxanadu", '比村奇石':"himura_kiseki", '女武神':"bunny_girl", "初音": 'hatsune_miku',
'芙兰':'flandre_scarlet', '幽幽子':'saigyouji_yuyuko', "神子":"toyosatomimi_no_miko", '青蛙子':'moriya_suwako', '宵宫':'yoimiya_(genshin_impact)','巫恋':'shamare_(arknights)',
'妖精骑士兰斯洛特':'fairy_knight_lancelot_(fate)', '妖兰':'fairy_knight_lancelot_(fate)','亚尔缇娜':'altina_orion','岛风':'shimakaze'}
map_tags_fuzzy = {"vtb":["youtuber","hololive","vshojo"],  '妖精骑士':'fairy_knight', '布鲁':'blue', '魔王':'maou', '风花雪月':'fire_emblem_three_houses', '心海': 'kokomi'}
map_wife = {"key":"我老婆", '359143328':['remilia_scarlet', 'sorasaki_hina', 'flandre_scarlet'], '691796451':['takanashi_hoshino', ]}